# Chapter 3. Pandas - 데이터 정제 및 전처리

In [1]:
import numpy as np
import pandas as pd

# 복습

### 1.
다음의 데이터 프레임에 대한 문제에 답하시오.

In [2]:
df = pd.DataFrame([[0.3,0.2,0.6,0.9],
                   [0.7,0.3,0.3,0.6],
                   [0.1,0.5,0.7,0.5],
                   [0.6,0.4,0.1,0.3],
                   [0.8,0.9,0.2,0.4]], columns = ['A','B','C','D'])
df

     A    B    C    D
0  0.3  0.2  0.6  0.9
1  0.7  0.3  0.3  0.6
2  0.1  0.5  0.7  0.5
3  0.6  0.4  0.1  0.3
4  0.8  0.9  0.2  0.4

##### 1).
loc를 이용하여 'C'열의 2행을 출력하시오.

In [3]:
df.loc[1,'C']

0.3

##### 2).
iloc를 이용하여 2열 3행을 출력하시오.

In [4]:
df.iloc[2][3]

0.5

##### 3).
loc를 사용하여 'B' ~ 'D'열의 1~3행을 출력하시오.

In [5]:
df.loc[0:2,'B':'D'] # loc는 열을 지정할 때 숫자를 사용할 수 없다.

     B    C    D
0  0.2  0.6  0.9
1  0.3  0.3  0.6
2  0.5  0.7  0.5

##### 4).
iloc를 사용하여 0 ~ 2열의 2 ~ 4행을 출력하시오.

In [6]:
df.iloc[2:5, 0:3]

     A    B    C
2  0.1  0.5  0.7
3  0.6  0.4  0.1
4  0.8  0.9  0.2

### 2.
Iris 데이터를 이용하여 문제에 답하시오.

In [7]:
import sklearn
from sklearn.datasets import load_iris

raw_data = load_iris()
data = pd.DataFrame(data = raw_data.data, columns = raw_data.feature_names)

data['Target'] = raw_data.target
data.head(3)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0

##### 1).
sepal length 열의 값을 모두 선택하시오.

In [8]:
data['sepal length (cm)'].head()

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal length (cm), dtype: float64

##### 2).
인덱스가 2인 행을 출력하시오.  
(단, iloc 사용)

In [9]:
data.iloc[2]

sepal length (cm)    4.7
sepal width (cm)     3.2
petal length (cm)    1.3
petal width (cm)     0.2
Target               0.0
Name: 2, dtype: float64

##### 3).
인덱스 라벨이 2인 행을 출력하시오.  
(단, loc 사용)

In [10]:
data.loc[2]

sepal length (cm)    4.7
sepal width (cm)     3.2
petal length (cm)    1.3
petal width (cm)     0.2
Target               0.0
Name: 2, dtype: float64

##### 4).
인덱스가 3인 행부터 인덱스가 7인 행까지 선택하시오.  
(단, iloc 사용)

In [11]:
data.iloc[3:8]

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
5,5.4,3.9,1.7,0.4,0
6,4.6,3.4,1.4,0.3,0
7,5.0,3.4,1.5,0.2,0

##### 5).
인덱스 라벨이 3인 행부터 인덱스 라벨이 7인 행까지 선택하시오.  
(단, loc 사용)

In [12]:
data.loc[3:7]

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0
5,5.4,3.9,1.7,0.4,0
6,4.6,3.4,1.4,0.3,0
7,5.0,3.4,1.5,0.2,0

##### 6).
인덱스 라벨이 5인 행의 petal length 열의 값을 출력하시오.  
(단, loc 사용)

In [13]:
data.loc[5,'petal length (cm)']

1.7

##### 7).
전체 데이터 프레임에서 sepal width 열에서 3보다 큰 행만 선택하시오.

In [14]:
data[data['sepal width (cm)'] > 3].head(3)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),Target
0,5.1,3.5,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0

# Missing data

In [15]:
sr = pd.Series([0,1,np.nan,3,4])
sr

0    0.0
1    1.0
2    NaN
3    3.0
4    4.0
dtype: float64

In [16]:
sr.isna()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [17]:
sr.isnull()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [18]:
sr.notna()

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [19]:
sr.isna().sum()

1

In [20]:
df = pd.DataFrame({'A' : [1,2,None,4,None],
                   'B' : [None,6,7,None,9]})

In [21]:
df_na = df.isna()
print(df_na)

       A      B
0  False   True
1  False  False
2   True  False
3  False   True
4   True  False

In [22]:
mask = df_na.any(axis = 1)
result = df[mask]
result

     A    B
0  1.0  NaN
2  NaN  7.0
3  4.0  NaN
4  NaN  9.0

### 결측치 이전 값으로 대체

In [23]:
sr = pd.Series([0,1,np.nan,np.nan,4])
sr

0    0.0
1    1.0
2    NaN
3    NaN
4    4.0
dtype: float64

In [24]:
sr.fillna(method = 'ffill')

0    0.0
1    1.0
2    1.0
3    1.0
4    4.0
dtype: float64

### 결측치 이전 값으로 대체

In [25]:
sr.fillna(method = 'bfill')

0    0.0
1    1.0
2    4.0
3    4.0
4    4.0
dtype: float64

### 실습

In [27]:
raw_airplane = pd.read_csv('./Data/airplane_info.csv', encoding = 'cp949')
raw_flight_route = pd.read_csv('./Data/flight_route_info.csv', encoding = 'cp949')

import copy
airplane = copy.deepcopy(raw_airplane)
flight_route = copy.deepcopy(raw_flight_route)

flight_route.head()

,노선명,항공사,출발지,출발국,도착지,도착국,검수,2016.6,2018.5,상태,...,운송량_여름 총합,운송량_2016.9,운송량_2016.10,운송량_2016.11,운송량_2017.9,운송량_2017.10,운송량_2017.11,운송량_2016가을,운송량_2017가을,운송량_가을 총합
0,7J105,Tajik Air,DYU,TJK,IKA,IRI,O,O,O,완료,...,4258,842,985,596,746,597,448,2423,1791,4214
1,7J117,Tajik Air,DYU,TJK,DEL,IND,O,O,O,완료,...,3440,794,815,990,224,0,0,2599,224,2823
2,7J4801,Tajik Air,DYU,TJK,SVX,RUS,O,O,O,완료,...,3949,970,896,596,745,448,448,2462,1641,4103
3,7J4805,Tajik Air,DYU,TJK,SGC,RUS,O,O,O,완료,...,0,0,0,298,0,0,0,298,0,298
4,7J4849,Tajik Air,DYU,TJK,FRU,KGZ,O,O,O,완료,...,3604,767,788,596,298,0,0,2151,298,2449

##### 결측치 확인

In [28]:
flight_route.isna().sum()

노선명            0
항공사            0
출발지            0
출발국            0
도착지            0
              ..
운송량_2017.10    0
운송량_2017.11    0
운송량_2016가을     0
운송량_2017가을     0
운송량_가을 총합      0
Length: 91, dtype: int64

In [29]:
flight_route_na = flight_route.isna().sum()
(flight_route_na[flight_route_na > 0] / len(flight_route) * 100).sort_values(ascending = False)

비고    60.856721
dtype: float64

In [30]:
flight_route['비고'].value_counts(dropna = False).head()

비고
NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2016.10 한 달 운항            2
2017.03.24. 이후 폐선         2
Name: count, dtype: int64

### 결측치 제거

In [31]:
df = pd.DataFrame({'A' : [1,2,None,4,5],
                   'B' : [None,6,7,None,9],
                   'C' : [10,11,12,13,14]})

In [32]:
df_cols = df.dropna(axis = 1)
df_rows = df.dropna()

In [33]:
df_cols

    C
0  10
1  11
2  12
3  13
4  14

In [34]:
df_rows

     A    B   C
1  2.0  6.0  11
4  5.0  9.0  14

# Duplicate data

In [35]:
df = pd.DataFrame({'A' : [1,2,3,1,3],
                   'B' : ['apple','banana','apple','apple','apple'],
                   'C' : [10,20,30,10,30]})

In [36]:
df.drop_duplicates()

   A       B   C
0  1   apple  10
1  2  banana  20
2  3   apple  30

# Replace data

In [37]:
data = pd.DataFrame({'food' : ['bacon','pulled prok','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham'],
                     'ounces' : [4,3,12,6,7.5,8,3,5]})
data

          food  ounces
0        bacon     4.0
1  pulled prok     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0

In [38]:
data['food'] = data['food'].str.lower()
data

          food  ounces
0        bacon     4.0
1  pulled prok     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0

In [39]:
data = pd.DataFrame({'food' : ['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','베이컨'],
                     'ounces' : [4,3,12,6,7.5,8,3,5,7]})
data.replace('베이컨','bacon', inplace = True)
data['food'] = data['food'].str.lower()
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8        bacon     7.0

In [40]:
sr = pd.Series([17, 18.2, 21, 21, 23, -999, 21, -19])
sr

0     17.0
1     18.2
2     21.0
3     21.0
4     23.0
5   -999.0
6     21.0
7    -19.0
dtype: float64

In [41]:
sr.replace(-999, np.nan, inplace = True)
sr

0    17.0
1    18.2
2    21.0
3    21.0
4    23.0
5     NaN
6    21.0
7   -19.0
dtype: float64

In [42]:
sr = pd.Series([17, 18.2, 21, 21, 23, -999, 21, -19])
sr.replace({-999 : np.nan, -19 : 19}, inplace = True)
sr

0    17.0
1    18.2
2    21.0
3    21.0
4    23.0
5     NaN
6    21.0
7    19.0
dtype: float64

In [43]:
sr[sr < 0] = np.nan
sr

0    17.0
1    18.2
2    21.0
3    21.0
4    23.0
5     NaN
6    21.0
7    19.0
dtype: float64

# Mapping data

In [44]:
meat_dict = {'bacon' : 'pig',
             'pulled pork' : 'pig',
             'pastrami' : 'cow',
             'corned beef' : 'cow',
             'honey ham' : 'pig'}

In [45]:
data['animal'] = data['food'].map(meat_dict)
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     pastrami     6.0    cow
4  corned beef     7.5    cow
5        bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8        bacon     7.0    pig

In [46]:
data['animal'] = data['food'].str.lower().map(meat_dict)
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     pastrami     6.0    cow
4  corned beef     7.5    cow
5        bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8        bacon     7.0    pig

In [47]:
data['animal'] = data['food'].map(lambda x : meat_dict[x.lower()])
data

          food  ounces animal
0        bacon     4.0    pig
1  pulled pork     3.0    pig
2        bacon    12.0    pig
3     pastrami     6.0    cow
4  corned beef     7.5    cow
5        bacon     8.0    pig
6     pastrami     3.0    cow
7    honey ham     5.0    pig
8        bacon     7.0    pig

In [48]:
data['ounces'] = data['ounces'].map(lambda x : x * 28.35)
data.rename(columns = {'ounces':'kg'}, inplace = True)
data

          food       kg animal
0        bacon  113.400    pig
1  pulled pork   85.050    pig
2        bacon  340.200    pig
3     pastrami  170.100    cow
4  corned beef  212.625    cow
5        bacon  226.800    pig
6     pastrami   85.050    cow
7    honey ham  141.750    pig
8        bacon  198.450    pig

In [49]:
data.index = data.index.map(lambda x : '주문 {}'.format(x + 1))
data

             food       kg animal
주문 1        bacon  113.400    pig
주문 2  pulled pork   85.050    pig
주문 3        bacon  340.200    pig
주문 4     pastrami  170.100    cow
주문 5  corned beef  212.625    cow
주문 6        bacon  226.800    pig
주문 7     pastrami   85.050    cow
주문 8    honey ham  141.750    pig
주문 9        bacon  198.450    pig

In [50]:
data.rename_axis(index = '주문 번호')

              food       kg animal
주문 번호
주문 1         bacon  113.400    pig
주문 2   pulled pork   85.050    pig
주문 3         bacon  340.200    pig
주문 4      pastrami  170.100    cow
주문 5   corned beef  212.625    cow
주문 6         bacon  226.800    pig
주문 7      pastrami   85.050    cow
주문 8     honey ham  141.750    pig
주문 9         bacon  198.450    pig

In [51]:
data.set_index('food')

                  kg animal
food
bacon        113.400    pig
pulled pork   85.050    pig
bacon        340.200    pig
pastrami     170.100    cow
corned beef  212.625    cow
bacon        226.800    pig
pastrami      85.050    cow
honey ham    141.750    pig
bacon        198.450    pig

In [52]:
data

             food       kg animal
주문 1        bacon  113.400    pig
주문 2  pulled pork   85.050    pig
주문 3        bacon  340.200    pig
주문 4     pastrami  170.100    cow
주문 5  corned beef  212.625    cow
주문 6        bacon  226.800    pig
주문 7     pastrami   85.050    cow
주문 8    honey ham  141.750    pig
주문 9        bacon  198.450    pig

# Apply

In [53]:
df = pd.DataFrame(np.random.randn(4, 3),
                  columns = ['a','b','c'],
                  index = list('ABCD'))
df

          a         b         c
A -0.305152  0.102755  0.110209
B  1.275908 -2.290633 -0.153459
C  0.517300  0.731274 -1.181821
D  0.079603 -1.729700  1.840343

In [54]:
df.apply(lambda x : x.mean())

a    0.391914
b   -0.796576
c    0.153818
dtype: float64

In [55]:
df.apply(lambda x : x.mean(), axis = 'columns')

A   -0.030730
B   -0.389395
C    0.022251
D    0.063415
dtype: float64

In [56]:
df.applymap(lambda x : '{:.2f}'.format(x))

       a      b      c
A  -0.31   0.10   0.11
B   1.28  -2.29  -0.15
C   0.52   0.73  -1.18
D   0.08  -1.73   1.84

# Sort

In [57]:
df.sort_index()

          a         b         c
A -0.305152  0.102755  0.110209
B  1.275908 -2.290633 -0.153459
C  0.517300  0.731274 -1.181821
D  0.079603 -1.729700  1.840343

In [58]:
df.sort_index(axis = 1, ascending = False)

          c         b         a
A  0.110209  0.102755 -0.305152
B -0.153459 -2.290633  1.275908
C -1.181821  0.731274  0.517300
D  1.840343 -1.729700  0.079603

In [59]:
df.sort_values(by = 'a', ascending = False)

          a         b         c
B  1.275908 -2.290633 -0.153459
C  0.517300  0.731274 -1.181821
D  0.079603 -1.729700  1.840343
A -0.305152  0.102755  0.110209